# rules/windows/process_creation/placeholder_rule.yml

title: A Placeholder Rule
id: b59c5f22-43a8-43a9-807c-5eb512584f09
status: test
level: low
author: signus
date: 2023/04/24
description: |
  A sample placeholder rule that does nothing. :)
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        Image|endswith: '\placeholder.exe'
        CommandLine|contains:
            - 'TODO'
    condition: selection
falsepositives:
    - None

